from classes import *
from ticker import *

class Game:
	def __init__(self):
		self.ticker = Ticker()
		
		#константы:
		self.minspeed = 30 					#минимальная 
		self.maxspeed = 120 					#и максимальная начальная скорость
		self.intervalmin = [30,25,20,15] 		#минимальный 
		self.intervalmax = [70,65,40,105] 		#и максимальный интервал появления автомобилей на каждой дороге

		#              входящая или  id дорог, на которые     координаты соответствующих съездов:
		#задаём:    id  выходящая    авто может съехать     на текущей дороге         на съезжаемой дороге
		self.roads = [Road(0, -1, 	[1,3,5,7], 	[3000, 750, 1500, 2250],  		 [0,0,0,0]), 
				 Road(1, -1, 		[-1],		 	[1000],					 	 [0])	  ,
				 Road(2,  1, 		[0],		 	[1000],						 [250])	  ,
				 Road(3, -1, 		[-1],		 	[1000],			    		 [0])	  ,
				 Road(4,  1, 		[0],		 	[1000],						 [1000])	  ,
				 Road(5, -1, 		[-1],		 	[1000],						 [0])	  ,
				 Road(6,  1, 		[0],		 	[1000],					 	 [1750])  ,
				 Road(7, -1, 		[-1],		 	[1000],					  	 [0])	  ,
				 Road(8,  1, 		[0],		 	[1000],					 	 [2500])  ,]
	def tick(self):
		self.ticker.tick(self)